<?php
echo "<h1>Задача №2 16 вариант, высокий уровень, 2.2</h1>";
if(isset($_POST["mas1"])){
    $mas1 = $_POST["mas1"];
    if (strpos($mas1, '-') === 0) {
        $mas1 = substr($mas1, 1); 
        echo "вы ввели число с минусом! <br/>";
    }
    if (strlen($mas1) < 4) {
        echo "вы ввели не четырехзначное число <br/>";
    } else {
    $a0 = (int)$mas1[0];
    $a1 = (int)$mas1[1];
    $a2 = (int)$mas1[2];
    $a3 = (int)$mas1[3];
        if ($a0 + $a1 + $a2 + $a3 == 0) {
            echo "вы ввели все нули <br/>";
        } else {
            if (($a0 + $a1) == ($a2 + $a3)) {
                echo 'Сумма первых и последних чисел равна <br/>';
            } else {
                echo 'Сумма первых и последних чисел не равна <br/>';
            }
            if ((($a0 + $a1 + $a2 + $a3) % 7) == 0) {
                echo 'Сумма первых и последних чисел кратна 7 <br/>';
            } else {
                echo "Сумма первых и последних чисел не кратна 7";
            }
        }
    }
}
